arnaldojr/CursoPIC/labintegrado2014/Documentação/cd labtools/mclab3/Exemplos/PIC18F4550/Exemplo 23 - exemplos LCD 128 x 64/Exe2/Exe2.c
#define SDI	 		PORTCbits.RC4		// PINO SDI DO CONTROLADOR TOUCH
#define SDO	 		LATCbits.LATC7		// PINO SDO DO CONTROLADOR TOUCH
#define SCK	 		LATBbits.LATB1		// PINO SCK DO CONTROLADOR TOUCH
#define CS_T 		LATAbits.LATA2		// PINO CHIP SELECT DO CONTROLADOR TOUCH

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                          Configurações do Pic                           *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

void main()
{
	RCON = 0x7F;					// Reset control
									// IPEN=0 modo compativel com
    								// 16F, toda int. no end. 0x0008

	PORTA = 0x00;                       //Limpa PORTA
	PORTB = 0x00;                       //Limpa PORTB
	PORTC = 0x00;		         	    //Limpa PORTC
	PORTD = 0x00;                       //Limpa PORTD
	PORTE = 0x00;                       //Limpa PORTE

	LATA = 0x00;                      	//Limpa PORTA
	LATB = 0x00;                        //Limpa PORTB
	LATC = 0x00;		     	        //Limpa PORTC
	LATD = 0x00;                        //Limpa PORTD
	LATE = 0x00;                        //Limpa PORTE

			//76543210
	TRISA = 0b11111011;                 //CONFIG DIREÇÃO DOS PINOS PORTA
	TRISB = 0b00111100;                 //CONFIG DIREÇÃO DOS PINOS PORTB
	TRISC = 0b01111111;		            //CONFIG DIREÇÃO DOS PINOS PORTC
	TRISD = 0b00000000;                 //CONFIG DIREÇÃO DOS PINOS PORTD
	TRISE = 0b00001100;                 //CONFIG DIREÇÃO DOS PINOS PORTE

	ADCON1 = 0b00001111;                //DESLIGA CONVERSORES A/D
	CMCON  = 0x07;

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                        Inicialização do Sistema                     *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

	Delay1KTCYx(200);		// Tempo de acomodação do LCD

	glcd_init(ON);			// Inicializa LCD

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
 *                              Rotina principal                           *
 * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

	carrega_imagem();		// Rotina de carregamento de imagem no dispay
	while(1);

}

void carrega_imagem(void)
{
	unsigned char dado;
	unsigned char x,y,i,c,l;
   	unsigned char chip = SEL_GLCD_CS1;	// Stores which chip to use on the LCD

	i = 0;
	for (y=0;y<8;y++)					// Varredura vertical do LCD
	{
		
		for (x=0;x<128;x++)				// Varredura horizontal do LCD
		{
			if ( y<2 )					// Limitação do compilador força divisão 
				dado = imagem1[i];		// da imagem em 4 bancos de 256 bytes
			if ( y>1 && y<4 )		
				dado = imagem2[i];
			if ( y>3 && y<6)		
				dado = imagem3[i];
			if ( y>5 && y<8)		
				dado = imagem4[i];

			// Set for instruction
            RS = 0;
	
			c = x;
		   	if(c > 63)  						// Check for first or second display area
		   	{
				c -= 64;
		      	chip = SEL_GLCD_CS2;
		   	}
			else
				chip = SEL_GLCD_CS1;
		
			c = c & 0b01111111;										// Clear the MSB. Part of an instruction code								
			c = c | 0b01000000;										// Set bit 6. Also part of an instruction code
		   	glcd_writeByte(chip, c);								// Set the horizontal address
		    //	glcd_writeByte(chip, (y/8 & 0b10111111) | 0b10111000);	// Set the vertical page address
			l = y;
			glcd_writeByte(chip, l | 0b10111000);	

			// Set for data
            RS = 1;
	
			glcd_writeByte(chip, dado);								// Escreve byte no display
			
			i++;		// Incrementa índice
		}
			
	}

}



/*
**===========================================================================
**===========================================================================
**
**          FUNÇÕES DE CONTROLE DO LCD 128 X 64
**
**===========================================================================
**===========================================================================
*/

// Purpose:       Initialize a graphic LCD. This must be called before any
//                other glcd function is used.
// Inputs:        The initialization mode
//                OFF - Turns the LCD off
//                ON  - Turns the LCD on
// Date:          5/28/2003
void glcd_init(unsigned char mode)
{
	RST = 1;
	E = 0;
	CS1 = 0;
	CS2 = 0;
	RS = 0;              // Set for instruction

	glcd_writeByte(SEL_GLCD_CS1, 0xC0);     // Specify first RAM line at the top
   	glcd_writeByte(SEL_GLCD_CS2, 0xC0);     // of the screen
   	glcd_writeByte(SEL_GLCD_CS1, 0x40);     // Set the column address to 0
   	glcd_writeByte(SEL_GLCD_CS2, 0x40);
   	glcd_writeByte(SEL_GLCD_CS1, 0xB8);     // Set the page address to 0
   	glcd_writeByte(SEL_GLCD_CS2, 0xB8);

	if(mode == ON)
   	{
    	glcd_writeByte(SEL_GLCD_CS1, 0x3F);	// Turn the display on
      	glcd_writeByte(SEL_GLCD_CS2, 0x3F);
   	}
   	else
   	{
    	glcd_writeByte(SEL_GLCD_CS1, 0x3E);	// Turn the display off
      	glcd_writeByte(SEL_GLCD_CS2, 0x3E);
   	}

	glcd_fillScreen(OFF);               	// Clear the display

}
// Purpose:       Turn a pixel on a graphic LCD on or off
// Inputs:        x - the x coordinate of the pixel
//                y - the y coordinate of the pixel
//                color - ON or OFF
// Output:        1 if coordinate out of range, 0 if in range
void glcd_pixel(unsigned char x, unsigned char y, unsigned char color)
{
	unsigned char data;
	unsigned char tmp;
   	unsigned char chip = SEL_GLCD_CS1;	// Stores which chip to use on the LCD

   	if(x > 63)  						// Check for first or second display area
   	{
		x -= 64;
      	chip = SEL_GLCD_CS2;
   	}

	// Set for instruction
	RS = 0;

	x = x & 0b01111111;										// Clear the MSB. Part of an instruction code
	x = x | 0b01000000;										// Set bit 6. Also part of an instruction code
   	glcd_writeByte(chip, x);								// Set the horizontal address
   	glcd_writeByte(chip, (y/8 & 0b10111111) | 0b10111000);	// Set the vertical page address

	// Set for data
	RS = 1;

	data = glcd_readByte(chip);

	if(color == ON)
	{
		tmp = 0b00000001;									// Turn the pixel on
		tmp = tmp << (y%8);
		data = data | tmp;
	}
	else
	{														// or
		tmp = 0b00000001;									// turn the pixel off
		tmp = ~(tmp << (y%8));
		data = data & tmp;
    }

