arnaldojr/CursoPIC/labintegrado2014/Documentação/cd labtools/mclab3/Exemplos/PIC18F4550/Exemplo 23 - exemplos LCD 128 x 64/Exe2/Exe2.c
	// Set for instruction
	RS = 0;
   	glcd_writeByte(chip, x);								// Set the horizontal address

	// Set for data
	RS = 1;
   	glcd_writeByte(chip, data);								// Write the pixel data
}


// Purpose:       Draw a line on a graphic LCD using Bresenham's
//                line drawing algorithm
// Inputs:        (x1, y1) - the start coordinate
//                (x2, y2) - the end coordinate
//                color - LCD_ON or LCD_OFF
// Dependencies:  glcd_pixel()
void glcd_line(unsigned char x1, unsigned char y1, unsigned char x2, unsigned char y2, unsigned char color)
{
	signed char  x, y, addx, addy, dx, dy;
   	signed long P;
   	unsigned char i;

   	if( x2 > x1 )
   		dx = x2 - x1;
   	else
   		dx = x1 - x2;

   	if( y2 > y1 )
   		dy = y2 - y1;
   	else
   		dy = y1 - y2;

   	x = x1;
   	y = y1;

	if(x1 > x2)
		addx = -1;
   	else
   		addx = 1;

   	if(y1 > y2)
   		addy = -1;
   	else
   		addy = 1;

   	if(dx >= dy)
   	{
		P = 2*dy - dx;

      	for(i=0; i<=dx; ++i)
      	{
			glcd_pixel(x, y, color);

			if(P < 0)
         	{
            	P += 2*dy;
            	x += addx;
			}
         	else
			{
            	P += 2*dy - 2*dx;
            	x += addx;
            	y += addy;
         	}
		}
	}
   	else
   	{
		P = 2*dx - dy;

      	for(i=0; i<=dy; ++i)
      	{
			glcd_pixel(x, y, color);

			if(P < 0)
			{
            	P += 2*dx;
            	y += addy;
			}
         	else
         	{
	            P += 2*dx - 2*dy;
	            x += addx;
	            y += addy;
         	}
      	}
   	}
}
// Purpose:       Draw a rectangle on a graphic LCD
// Inputs:        (x1, y1) - the start coordinate
//                (x2, y2) - the end coordinate
//                fill  - YES or NO
//                color - ON or OFF
// Dependencies:  glcd_pixel(), glcd_line()
void glcd_rect(unsigned char x1, unsigned char y1, unsigned char x2, unsigned char y2, unsigned char fill, unsigned char color)
{
	if(fill)
   	{
		unsigned char y, ymax;								// Find the y min and max
      	if(y1 < y2)
      	{
			y = y1;
         	ymax = y2;
		}
      	else
      	{
			y = y2;
         	ymax = y1;
		}

		for(; y<=ymax; ++y) glcd_line(x1, y, x2, y, color);	// Draw lines to fill the rectangle

	}
   	else
   	{
		glcd_line(x1, y1, x2, y1, color);      				// Draw the 4 sides
		glcd_line(x1, y2, x2, y2, color);
		glcd_line(x1, y1, x1, y2, color);
		glcd_line(x2, y1, x2, y2, color);
   	}
}


// Purpose:       Draw a bar (wide line) on a graphic LCD
// Inputs:        (x1, y1) - the start coordinate
//                (x2, y2) - the end coordinate
//                width  - The number of pixels wide
//                color - ON or OFF
void glcd_bar(unsigned char x1, unsigned char y1, unsigned char x2, unsigned char y2, unsigned char width, unsigned char color)
{
	signed char  x, y, addx, addy, j;
   	signed long P, dx, dy, c1, c2;
   	unsigned char i;

   	dx = fabs((signed char)(x2 - x1));
   	dy = fabs((signed char)(y2 - y1));
   	x = x1;
   	y = y1;

   	c1 = -dx*x1 - dy*y1;
   	c2 = -dx*x2 - dy*y2;

   	if(x1 > x2)
   	{
		addx = -1;
      	c1 = -dx*x2 - dy*y2;
      	c2 = -dx*x1 - dy*y1;
   	}
   	else addx = 1;
	if(y1 > y2)
   	{
		addy = -1;
      	c1 = -dx*x2 - dy*y2;
      	c2 = -dx*x1 - dy*y1;
   	}
	else addy = 1;

	if(dx >= dy)
   	{
		P = 2*dy - dx;

      	for(i=0; i<=dx; ++i)
      	{
			for(j=-(width/2); j<width/2+width%2; ++j)
         	{
            	if(dx*x+dy*(y+j)+c1 >= 0 && dx*x+dy*(y+j)+c2 <=0)
				glcd_pixel(x, y+j, color);
         	}
         	if(P < 0)
         	{
            	P += 2*dy;
            	x += addx;
         	}
         	else
         	{
            	P += 2*dy - 2*dx;
            	x += addx;
            	y += addy;
         	}
		}
   	}
   	else
   	{
		P = 2*dx - dy;

      	for(i=0; i<=dy; ++i)
      	{
			if(P < 0)
         	{
            	P += 2*dx;
            	y += addy;
         	}
         	else
         	{
            	P += 2*dx - 2*dy;
            	x += addx;
            	y += addy;
         	}
         	for(j=-(width/2); j<width/2+width%2; ++j)
         	{
            	if(dx*x+dy*(y+j)+c1 >= 0 && dx*x+dy*(y+j)+c2 <=0)
               	glcd_pixel(x+j, y, color);
         	}
      	}
   	}
}

// Purpose:       Draw a circle on a graphic LCD
// Inputs:        (x,y) - the center of the circle
//                radius - the radius of the circle
//                fill - YES or NO
//                color - ON or OFF
void glcd_circle(unsigned char x, unsigned char y, unsigned char radius, unsigned char fill, unsigned char color)
{
	signed char a, b, P;

   	a = 0;
   	b = radius;
   	P = 1 - radius;

   	do
   	{
		if(fill)
      	{
			glcd_line(x-a, y+b, x+a, y+b, color);
         	glcd_line(x-a, y-b, x+a, y-b, color);
         	glcd_line(x-b, y+a, x+b, y+a, color);
         	glcd_line(x-b, y-a, x+b, y-a, color);
      	}
      	else
      	{
			glcd_pixel(a+x, b+y, color);
         	glcd_pixel(b+x, a+y, color);
         	glcd_pixel(x-a, b+y, color);
         	glcd_pixel(x-b, a+y, color);
         	glcd_pixel(b+x, y-a, color);
         	glcd_pixel(a+x, y-b, color);
         	glcd_pixel(x-a, y-b, color);
         	glcd_pixel(x-b, y-a, color);
      	}

      	if(P < 0) P+= 3 + 2*a++;
		else P+= 5 + 2*(a++ - b--);

	}while(a <= b);
}

// Purpose:       Fill the LCD screen with the passed in color.
//                Works much faster than drawing a rectangle to fill the screen.
// Inputs:        ON - turn all the pixels on
//                OFF - turn all the pixels off
// Dependencies:  glcd_writeByte()
void glcd_fillScreen(unsigned char color)
{
	unsigned char i, j;

   	// Loop through the vertical pages
   	for(i = 0; i<8; i++)
   	{

		// Set for instruction
		RS = 0;

      	glcd_writeByte(SEL_GLCD_CS2, 0b01000000);		// Set horizontal address to 0
		glcd_writeByte(SEL_GLCD_CS1, 0b01000000);
		glcd_writeByte(SEL_GLCD_CS2, i | 0b10111000);	// Set page address
		glcd_writeByte(SEL_GLCD_CS1, i | 0b10111000);

		// Set for data
		RS = 1;

		// Loop through the horizontal sections
      	for(j = 0; j < 64; j++)
      	{
			glcd_writeByte(SEL_GLCD_CS1, 0xFF*color);	// Turn pixels on or off
			glcd_writeByte(SEL_GLCD_CS2, 0xFF*color);	// Turn pixels on or off
      	}

   	}
}

// Purpose:       Write a byte of data to the specified chip
// Inputs:        chipSelect - which chip to write the data to
//                data - the byte of data to write

void glcd_writeByte(unsigned char chip, unsigned char data)
{
	// Choose which chip to write to
	if(chip == SEL_GLCD_CS1) CS1 = 1;
   	else CS2 = 1;

	// Set for writing
	RW = 0;
	BARRAMENTO = data;
	Nop();
	Nop();
	E = 1;
	Nop();
	Nop();
	E = 0;
	Nop();
	Nop();

	// Reset the chip select lines
	CS1 = 0;
	CS2 = 0;
}

// Purpose:       Reads a byte of data from the specified chip
// Ouputs:        A byte of data read from the chip
unsigned char glcd_readByte(unsigned char chip)
{
	unsigned char data=0;						// Stores the data read from the LCD

	// Choose which chip to write to
	if(chip == SEL_GLCD_CS1) CS1 = 1;
   	else CS2 = 1;

	// Set port d to input
	BARRAMENTO_TRIS = 0xFF;

	// Set for reading
	RW = 1;
	Nop();
	Nop();
	E = 1;
	Nop();
	Nop();
	E = 0;
	Nop();
	Nop();
	E = 1;
	Nop();
	Nop();
	data = BARRAMENTO;
	Nop();
	Nop();
	E = 0;

	// Reset the chip select lines
	CS1 = 0;
	CS2 = 0;

	// Set port d to output
	BARRAMENTO_TRIS = 0x00;

  	return data;               				// Return the read data
}